Revit 2027 API
BuiltInFailures.BeamSystemFailures.BeamSystemHasTooManyBeams Property
 A beam system is trying to create more than 500 beams. Please use multiple beam systems if more than 500 beams are desired.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId BeamSystemHasTooManyBeams { get; }
Public Shared ReadOnly Property BeamSystemHasTooManyBeams As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ BeamSystemHasTooManyBeams {
	FailureDefinitionId^ get ();
}
static member BeamSystemHasTooManyBeams : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.BeamSystemFailures Class
Autodesk.Revit.DB Namespace